package test03;

import java.util.HashMap;
import java.util.Map;

public class Main {
	public static void main(String[] args) {
		
		String[] sakuhinName = { "青びかる天弧のはてに", "青柳教諭を送る", "秋田街道", "あくたうかべる朝の水", "あけがた", "朝に就ての童話的構図", "雨ニモマケズ",
				"ありときのこ", "或る農学生の日誌", "イギリス海岸", "イギリス海岸", "いざ渡せかし　おいぼれめ", "泉ある家", "いちょうの実", "いてふの実", "イーハトーボ農学校の春",
				"インドラの網", "馬行き人行き自転車行きて", "うろこ雲（旧字旧仮名、", "駅長", "狼森と笊森、盗森", "狼森と笊森、盗森", "丘", "おきなぐさ", "オツベルと象", "女",
				"会計課", "開墾", "開墾地", "貝の火", "カイロ団長", "蛙のゴム靴", "蛙のゴム靴", "学者アラムハラドの見た着物", "かくまでに", "かしはばやしの夜", "かしわばやしの夜",
				"風の又三郎", "風野又三郎", "烏百態", "花壇工作", "家長制度", "月天讃歌（擬古調", "ガドルフの百合", "釜石よりの帰り", "烏の北斗七星", "烏の北斗七星", "雁の童子",
				"革トランク", "看痾", "甘藍の球は弾けて", "黄いろのトマト", "機会", "饑餓陣営一幕", "疑獄元兇", "気のいい火山弾", "気のいい火山弾", "饗宴",
				"銀河鉄道の夜（旧字旧仮名、", "銀河鉄道の夜", "銀河鉄道の夜", "銀河鉄道の夜", "「銀河鉄道の夜」初期形一", "グスコーブドリの伝記", "クねずみ", "蜘蛛となめくじと狸",
				"くもにつらなるでこぼこがらす", "雲ふかく　山裳を曳けば", "雲を濾し", "車", "黒ぶだう", "郡属伊原忠右エ門", "訓導", "月光の鉛のなかに", "虔十公園林", "虔十公園林",
				"幻想", "県道", "恋", "耕耘部の時計", "耕耘部の時計", "講後", "洪積の台のはてなる", "校庭", "氷と後光（旧字旧仮名、", "国柱会", "こはドロミット洞窟の", "こゝろ",
				"こゝろの影を恐るなと", "このみちの醸すがごとく", "こんにやくの", "さいかち淵", "さいかち淵", "祭日二", "サガレンと八月", "鷺はひかりの空に餓ゑ", "ざしき童子のはなし",
				"さるのこしかけ", "山地の稜", "シグナルとシグナレス", "紫紺染について", "鹿踊りのはじまり", "鹿踊りのはじまり", "四八　黄泉路", "疾中", "詩ノート", "島わにあらき潮騒を",
				"霜枯れのトマトの気根", "霧降る萱の細みちに", "十月の末", "十月の末", "十六日", "樹園", "棕梠の葉やゝに痙攣し", "春章作中判", "小祠", "職員室", "植物医師郷土喜劇",
				"水仙月の四日", "水仙月の四日", "水部の線", "スタンレー探検隊に対する二人のコンゴー土人の演説", "隅田川", "製炭小屋", "聖なる窓", "税務署長の冒険", "雪峡",
				"せなうち痛み息熱く", "セレナーデ　恋歌", "セロ弾きのゴーシュ", "一九三一年度極東ビヂテリアン大会見聞録", "僧園", "宗谷一", "宗谷二", "蒼冷と純黒", "そのかたち収得に似て",
				"台川", "台川", "対酌", "大礼服の例外的効果", "宅地", "たゞかたくなのみをわぶる", "谷", "谷", "種山ヶ原", "種山ヶ原", "タネリはたしかにいちにち噛んでいたようだった",
				"丹藤川「家長制度」先駆形", "中尊寺二", "注文の多い料理店", "注文の多い料理店", "『注文の多い料理店』広告文", "『注文の多い料理店』序", "『注文の多い料理店』序",
				"『注文の多い料理店』新刊案内", "チュウリップの幻術", "ツェねずみ", "月夜のけだもの", "月夜のでんしんばしら", "月夜のでんしんばしら", "月夜のでんしんばしらの軍歌",
				"土神ときつね", "土神と狐", "土をも掘らん汗もせん", "つめたき朝の真鍮に", "手紙　一", "手紙　三", "手紙　二", "手紙　四", "田園迷信", "電車", "毒蛾",
				"毒もみのすきな署長さん", "床屋", "図書館幻想（旧字旧仮名、", "とっこべとら子", "鳥箱先生とフウねずみ", "鳥をとるやなぎ", "どんぐりと山猫", "どんぐりと山猫", "ながれたり",
				"なべてはしけく　よそほひて", "鉛のいろの冬海の", "なめとこ山の熊", "楢ノ木大学士の野宿", "楢ノ木大学士の野宿", "虹の絵の具皿（十力の金剛石", "二十六夜", "二十六夜", "沼森",
				"猫", "猫の事務所……ある小さな官衙に関する幻想……", "農学校歌", "農民芸術概論", "農民芸術概論綱要", "農民芸術の興隆", "バキチの仕事", "雹雲砲手", "化物丁場",
				"凾館港春夜光景", "畑のへり", "八戸", "廿日月かざす刃は音無しの", "花巻農学校精神歌", "花椰菜", "林の底", "隼人", "茨海小学校", "『春と修羅』", "春と修羅",
				"春と修羅　第三集", "春と修羅　第二集", "『春と修羅』補遺", "ひかりの素足", "秘境", "卑屈の友らをいきどほろしく", "ビジテリアン大祭", "ひとひははかなくことばをくだし",
				"ひのきとひなげし", "火の島", "氷河鼠の毛皮", "病中幻想", "火渡り", "不軽菩薩", "二川こゝにて会したり", "双子の星", "二人の役人", "二人の役人", "葡萄水",
				"フランドン農学校の豚", "文語詩稿　一百篇", "文語詩稿　五十篇", "ペンネンネンネンネン・ネネムの伝記", "ペンネンノルデはいまはいないよ　太陽にできた黒い棘をとりに行ったよ",
				"北守将軍と三人兄弟の医者", "星めぐりの歌", "ポラーノの広場", "洞熊学校を卒業した三人", "ポランの広場", "マグノリアの木", "ま青きそらの風をふるはし", "祭の晩",
				"まなづるとダァリヤ", "まひるつとめにまぎらひて", "マリヴロンと少女", "みじかい木ぺん", "めくらぶどうと虹", "モザイク成り", "最も親しき友らにさへこれを秘して",
				"館は台地のはななれば", "柳沢", "敗れし少年の歌へる", "山男の四月", "山男の四月", "やまなし", "やまなし", "遊園地工作", "夕陽は青めりかの山裾に", "ゆがみつゝ月は出で",
				"雪とひのきの坂上に", "雪渡り", "雪渡り", "弓のごとく", "百合を掘る", "楊林", "よく利く薬とえらい薬", "よだかの星", "四又の百合", "ラジュウムの雁（旧字旧仮名、",
				"龍と詩人（旧字旧仮名、", "りんごのみきのはひのひかり", "昤々としてひかれるは", "若い木霊", "われかのひとをこととふに", "われ聴衆に会釈して", "われはダルケを名乗れるものと",
				"われらが書に順ひて", "われらひとしく丘に立ち", "青木大学士の野宿", "秋田街道", "石川善助追悼文", "馬の頭巾", "オツベルと象", "蛙の消滅", "かしはばやしの夜初期型",
				"風の又三郎", "花壇工作", "家長制度", "革トランク", "河原坊山脚の黎明", "饑餓陣営一幕", "疑獄元凶", "銀河鉄道の夜初期形第三次稿", "銀河鉄道の夜初期形第二次稿",
				"寓話猫の事務所……ある小さな官衙に関する幻想……", "寓話洞熊学校を卒業した三人", "グスコーブドリの伝記", "グスコンブドリの伝記", "車", "黒ぶどう", "クンねずみ",
				"けだもの運動会", "氷と後光（習作", "三人兄弟の医者と北守将軍韻文型", "三人兄弟の医者と北守将軍散文型", "疾中", "税務署長の冒険", "セロ弾きのゴーシュ", "大礼服の例外的効果",
				"種山ヶ原の夜", "「旅人のはなし」から", "「旅人のはなし」から", "月夜のけだもの", "月夜のけだもの初期型", "連れて行かれたダアリヤ",
				"連れて行かれたダァリヤ「連れて行かれたダアリヤ」初期型", "電車", "研師と園丁", "図書館幻想", "鳥箱先生とフゥねずみ", "なめとこ山の熊", "猫の事務所初期型", "農民芸術概論",
				"農民芸術概論綱要", "農民芸術の興隆", "化物丁場", "畑のへり", "畑のへり初期型", "花椰菜", "林の底", "『春と修羅』", "春と修羅（旧字旧仮名、", "ひかりの素足",
				"ひのきとひなげし初期型", "氷河鼠の毛皮", "復活の前", "復活の前", "葡萄水", "葡萄水初期型", "フランドン農学校の豚", "フランドン農学校の豚初期型", "北守将軍と三人兄弟の医者",
				"北守将軍と三人兄弟の医者初期型", "星めぐりの歌", "ポラーノの広場", "ポラーノの広場", "ポランの広場", "みあげた", "峯や谷は", "柳沢", "山男の四月初期型",
				"やまなし初期型", "雪渡り雑誌発表形", "よく利く薬とえらい薬", "よだかの星", "若い木霊", "若い研師" };

		Map<Integer, String>books = new HashMap<Integer, String>();
		
		System.out.println("格納開始");
		int i = 0;
		While (i<sakuhinName.length) {
		
		books.put(i+1, sakuhinName[i]);
		
		System.out.println("sakuhinnID:\t"+(i+1)+"\tsakuhinnmei:"+books.get(i+1));
		
		i++;
		}
		System.out.println("格納完了");
		
		
		
	}

}
